app/Controllers/Absensi.php

    public function tampilkan()
    {
        $kelas  = (array)$this->request->getGet('kelas');
        $lokasi = $this->request->getGet('lokasi');

        if (!$kelas || !$lokasi) {
            return redirect()->to('guru/absensi');
        }

        $murid = (new MuridModel())
            ->whereIn('kelas_id', $kelas)
            ->orderBy('kelas_id', 'ASC')
            ->orderBy('nama_depan', 'ASC')
            ->findAll();
---
SELECT *
FROM `murid`
WHERE `kelas_id` IN ('1')
ORDER BY `kelas_id` ASC, `nama_depan` ASC

        }

        // HEADER ABSENSI (1 guru / 1 lokasi / 1 hari)
        $absensi = $this->db->table('absensi')->where([
            'guru_id'   => $guruId,
            'tanggal'   => $tanggal,
            'lokasi_id' => $lokasiId
        ])->get()->getRow();
---
SELECT *
FROM `absensi`
WHERE `guru_id` = '6'
AND `tanggal` = '2026-02-03'
AND `lokasi_id` = 1

        $now = date('H:i:s');

        // AMBIL SEMUA MURID TERKAIT
        $murid = $this->db->table('murid')
            ->whereIn('kelas_id', $kelas)
            ->get()->getResultArray();
---
SELECT *
FROM `murid`
WHERE `kelas_id` IN ('1')

            $overlapWith = null;

            // CEK APAKAH MURID SUDAH ADA ABSENSI DI LOKASI LAIN
            $existing = $this->db->table('absensi_detail ad')
                ->select('ad.*, a.lokasi_id, a.guru_id, a.jam')
                ->join('absensi a','a.id=ad.absensi_id')
                ->where('ad.murid_id', $m['id'])
                ->where('a.tanggal', $tanggal)
                ->where('a.lokasi_id !=', $lokasiId)
                ->get()->getRow();
---
SELECT `ad`.*, `a`.`lokasi_id`, `a`.`guru_id`, `a`.`jam`
FROM `absensi_detail` `ad`
JOIN `absensi` `a` ON `a`.`id`=`ad`.`absensi_id`
WHERE `ad`.`murid_id` = '1'
AND `a`.`tanggal` = '2026-02-03'
AND `a`.`lokasi_id` != 1

                    $overlapWith = $existing->guru_id;

                    // ambil nama guru pertama
$guru = $this->db->table('users')
    ->select('nama_depan')
    ->where('id', $existing->guru_id)
    ->get()->getRow();
---
SELECT `nama_depan`
FROM `users`
WHERE `id` = '6'

            }

            // SIMPAN / UPDATE DETAIL
            $detail = $this->db->table('absensi_detail')->where([
                'absensi_id' => $absensiId,
                'murid_id'   => $m['id']
            ])->get()->getRow();
---
SELECT *
FROM `absensi_detail`
WHERE `absensi_id` = '34'
AND `murid_id` = '1'

public function hariIni()
{
    $guruId  = session()->get('user_id');
    $tanggal = date('Y-m-d');

    $absensi = $this->db->table('absensi')
        ->where('guru_id', $guruId)
        ->where('tanggal', $tanggal)
        ->orderBy('id','DESC')
        ->get()->getRow();

    if (!$absensi) {
        return view('guru/absensi_hari_ini', [
            'absensi' => null
        ]);
    }

    $detail = $this->db->table('absensi_detail ad')
        ->select('ad.*, m.nama_depan, m.nama_belakang, m.kelas_id')
        ->join('murid m','m.id=ad.murid_id')
        ->where('ad.absensi_id', $absensi->id)
        ->orderBy('m.kelas_id','ASC')
        ->orderBy('m.nama_depan','ASC')
        ->get()->getResultArray();
---
SELECT *
FROM `absensi`
WHERE `guru_id` = '6'
AND `tanggal` = '2026-02-03'
ORDER BY `id` DESC
SELECT `ad`.*, `m`.`nama_depan`, `m`.`nama_belakang`, `m`.`kelas_id`
FROM `absensi_detail` `ad`
JOIN `murid` `m` ON `m`.`id`=`ad`.`murid_id`
WHERE `ad`.`absensi_id` = '36'
ORDER BY `m`.`kelas_id` ASC, `m`.`nama_depan` ASC